{
  "common": {
    "name": "vis-homekittiles",
    "version": "0.4.8",
    "news": {
      "0.4.8": {
        "en": "Fixed issues from adapter checker",
        "de": "Behobene Probleme von Adapter Checker",
        "ru": "Исправленные проблемы от Adapter Checker",
        "pt": "Problemas corrigidos do verificador do adaptador",
        "nl": "Vaste problemen van adaptercontrole",
        "fr": "Correction des problèmes de l'adaptateur checker",
        "it": "Problemi risolti dall'adattatore checker",
        "es": "Problemas fijos desde el adaptador",
        "pl": "Naprawiono problemy z sprawdzania adaptera",
        "uk": "Виправлено проблеми з перевіркою адаптера",
        "zh-cn": "适配器检查器的固定问题"
      },
      "0.4.7": {
        "en": "Depencies updated",
        "de": "Depene aktualisiert",
        "ru": "Обновленная пенсия",
        "pt": "Propriedades atualizadas",
        "nl": "Bijgewerkte capaciteiten",
        "fr": "Dépendances mises à jour",
        "it": "Importazioni aggiornate",
        "es": "Depencies updated",
        "pl": "Zaktualizowane dawki",
        "uk": "Depencies оновлений",
        "zh-cn": "更新的负债"
      },
      "0.4.6": {
        "en": "Depencies updated",
        "de": "Abhängigkeiten aktualisiert",
        "ru": "Обновленная пенсия",
        "pt": "Deficiências atualizadas",
        "nl": "Bijgewerkte capaciteiten",
        "fr": "Dépendances mises à jour",
        "it": "Importazioni aggiornate",
        "es": "Depencies updated",
        "pl": "Zaktualizowane dawki",
        "uk": "Depencies оновлений",
        "zh-cn": "更新的负债"
      },
      "0.4.5": {
        "en": "hkt-Button-Set-Navigation-Submenu: added (optional) strokes to use with main menu widget",
        "de": "hkt-Button-Set-Navigation-Submenu: hinzugefügt (optional) Striche, um mit Hauptmenü Widget zu verwenden",
        "ru": "hkt-button-Set-Navigation-Submenu: добавленные (факультативно) штрихи для использования с основным виджетом меню",
        "pt": "hkt-Button-Set-Navigation-Submenu: adicionado (opcional) cursos para usar com widget de menu principal",
        "nl": "hkt-Button-Set-Navigation-Submenu: toegevoegde (optionele) lijnen te gebruiken met hoofdmenu-widget",
        "fr": "hkt-Button-Set-Navigation-Sous-menu: a ajouté (facultatif) des traits à utiliser avec le widget de menu principal",
        "it": "hkt-Button-Set-Navigation-Submenu: aggiunto (opzionale) ictus da usare con il widget del menu principale",
        "es": "hkt-Button-Set-Navigation-Submenu: añadidos (opcional) derrames a utilizar con el widget del menú principal",
        "pl": "hkt- Button- Set- Navigation- Submenu: dodane (opcjonalne) suwy do użycia z głównym widget menu",
        "uk": "hkt-Button-Set-Navigation-Submenu: додано (опція) штрихи для використання з основним меню віджет",
        "zh-cn": "hkt-Button-Set-Navigation-Submenu: 添加( 可选) 字串, 用于主菜单部件"
      },
      "0.4.2": {
        "en": "hkt-settings-value: added format options for decimals\nThermostat dialog: prevent select menu inside of dialogs from open when dialog window opens\nView in widget dialog: prevent select menu inside of dialogs from open when dialog window opens",
        "de": "hkt-settings-value: formatoptionen für dezimals hinzugefügt\nThermostat Dialog: Vorbeugen Sie das Menü innerhalb der Dialoge zu öffnen, wenn Dialogfenster öffnet\nAnsicht in Widget Dialog: verhindern Wählen Sie das Menü innerhalb der Dialoge öffnen, wenn Dialogfenster öffnet",
        "ru": "hkt-settings- value: added format options for decimals\nДиалог термостата: не допустить открытия выбранного меню в диалоговом окне\nВид в диалоговом окне виджета: не допустить открытия выбранного меню в диалоговом окне",
        "pt": "hkt-settings-value: opções de formato adicionado para decimais\nDiálogo termostato: evitar selecionar menu dentro de diálogos de abrir quando a janela de diálogo abrir\nVer no widget diálogo: evitar selecionar menu dentro de diálogos de abrir quando a janela de diálogo abrir",
        "nl": "hkt-instellingen-waarde: toegevoegde formaatopties voor decimalen\nThermostat dialoogvenster: voorkomen dat selecteermenu in dialoogvensters wordt geopend wanneer het dialoogvenster wordt geopend\nWeergave in widget-dialoog: selecteer menu in dialoogvensters niet openen wanneer het dialoogvenster wordt geopend",
        "fr": "hkt-settings-value: options de format ajouté pour les décimales\nBoîte de dialogue Thermostat : empêche le menu sélectionné à l'intérieur des dialogues d'ouvrir lorsque la fenêtre de dialogue s'ouvre\nAffichage dans la boîte de dialogue widget : empêcher que le menu sélectionné dans les dialogues s'ouvre lorsque la fenêtre de dialogue s'ouvre",
        "it": "hkt-settings-value: opzioni di formato aggiunti per decimali\nFinestra di dialogo Termostato: impedire selezionare menu all'interno delle finestre di dialogo da aprire quando si apre la finestra di dialogo\nVisualizza nella finestra di dialogo widget: impedire selezionare menu all'interno delle finestre di dialogo da aprire quando si apre la finestra di dialogo",
        "es": "hkt-settings-value: opciones de formato añadido para decimales\nDiálogo termostato: evitar que el menú seleccionado dentro de los diálogos se abra cuando se abra la ventana de diálogo\nVer en el diálogo widget: evitar que el menú seleccionado dentro de los diálogos se abra cuando se abra la ventana de diálogo",
        "pl": "hkt- settings- value: opcje formatu dodanego dla liczb dziesiętnych\nOkno termostatu: zapobiega otwieraniu menu wewnątrz dialogów po otwarciu okna dialogowego\nWidok w oknie dialogowym widget: zapobiega otwieraniu menu wewnątrz dialogów po otwarciu okna dialogowego",
        "uk": "hkt-settings-value: додано параметри формату для десятків\nТермостат діалогове вікно: запобігання вибору меню всередині діалогів з відкритими, коли діалогове вікно відкривається\nПерегляд у діалоговому вікні віджету: запобігання вибору меню всередині діалогів з відкритими, коли діалогове вікно відкривається",
        "zh-cn": "hkt 设置值: 十进制添加格式选项\n自动对话框: 当对话框窗口打开时, 防止对话框内部的菜单打开\n在部件对话框中查看: 当对话框窗口打开时, 对话框内部的菜单无法打开"
      },
      "0.4.1": {
        "en": "All tiles: added icon for state off\nOptimized CSS for indicator\nRemoved forced font-size of widgets in View-In-Widget-Swipe\nRemoved forced font-size of widgets in View-In-Widget-Dialog",
        "de": "Alle Fliesen: hinzugefügt Icon für Zustand off\nOptimierte CSS für Indikator\nEntfernte erzwungene Schriftgröße von Widgets in View-In-Widget-Swipe\nEntfernte erzwungene Schriftgröße von Widgets in View-In-Widget-Dialog",
        "ru": "Все плитки: добавленная иконка для отключения\nОптимизация CSS для индикатора\nУдаленный шрифт-размер виджетов в View-In-Widget-Swipe\nУдаленный шрифт-размер виджетов в View-In-Widget-Dialog",
        "pt": "Todas as telhas: ícone adicionado para estado fora\nCSS otimizado para indicador\nRemovedo tamanho de fonte forçado de widgets em View-In-Widget-Swipe\nRemovido tamanho de fonte forçado de widgets em View-In-Widget-Dialog",
        "nl": "Alle tegels: pictogram toegevoegd voor status uitgeschakeld\nGeoptimaliseerde CSS voor indicator\nGeforceerde lettergrootte van widgets in View-In-Widget-Swipe verwijderd\nGeforceerd lettertype-grootte van widgets in weergave-in-widget-dialoog verwijderen",
        "fr": "Toutes les tuiles: icône ajoutée pour l'état désactivé\nCSS optimisé pour indicateur\nSupprimé la taille de police forcée des widgets dans View-In-Widget-Swipe\nSupprimé la taille de police forcée des widgets dans View-In-Widget-Dialog",
        "it": "Tutte le piastrelle: aggiunta icona per stato spento\nCSS ottimizzato per indicatore\nRimossa la dimensione del carattere forzata dei widget in View-In-Widget-Swipe\nRimossa la dimensione del carattere forzata dei widget in View-In-Widget-Dialog",
        "es": "Todas las fichas: icono añadido para el estado apagado\nCSS optimizado para indicador\nEliminado de fuentes forzadas de widgets en View-In-Widget-Swipe\nEliminado de fuentes forzadas de widgets en View-In-Widget-Dialog",
        "pl": "Wszystkie płytki: dodana ikona stanu wyłączenia\nZoptymalizowany CSS dla wskaźnika\nUsunięty wymuszony rozmiar font- widgets w View- In- Widget- Swipe\nUsunięto wymuszony rozmiar font- widgetów w oknie View- In- Widget-",
        "uk": "Уся плитка: додана ікона для держави\nОптимізований CSS для індикатора\nВидалено примусовий розмір віджетів у View-In-Widget-Swipe\nВилучено примусовий розмір віджетів у View-In-Widget-Dialog",
        "zh-cn": "所有牌: 为状态关闭添加图标\n指标CSS优化\n在 View- In- Widget- Swipe 中删除了强制字体大小的部件\n删除 View- In-Widget- Dialog 中强制字体大小的部件"
      },
      "0.4.0": {
        "en": "Added Pinpad-Dialog\nAdded HTML-Dialog\nAdded hkt-Config-Modal (experimental): changes the styles of modal to blur instead of background color and transparency (modal darkens the background when a dialog window is open). For this config-item you need ipadOS 18.x to work with Safari or ioBroker Visu App. Simply place the config item somewhere in your VIS where it is always called (e.g. in the menu) and configure it as desired. It is not visible at runtime.\nMade \"modal\" to default setting\nSection 'dialog' splitted into 'dialog settings' and 'dialog content'\nMade values of SwitchBool customizable and renamed 'SwitchBool' to 'Switch'\nRepaired notification widget\nAdded Apple standard font 'SanFrancisco' to fonts (needed to be installed separatly)",
        "de": "Pinpad-Dialog hinzugefügt\nHTML-Dialog hinzugefügt\nHinzugefügt hkt-Config-Modal (experimental): ändert die Stile von Modal zu verschwimmen statt Hintergrundfarbe und Transparenz (modal verdunkelt den Hintergrund, wenn ein Dialogfenster geöffnet ist). Für dieses config-item benötigen Sie ipadOS 18.x, um mit Safari oder ioBroker Visu App zu arbeiten. Legen Sie einfach den config Artikel irgendwo in Ihrem VIS, wo er immer aufgerufen wird (z.B. im Menü) und konfigurieren Sie ihn wie gewünscht. Es ist nicht zur Laufzeit sichtbar.\nHergestellt \"modal\" zur Standardeinstellung\nAbschnitt \"Dialog\" aufgeteilt in \"Dialogeinstellungen\" und \"Dialoginhalte\" '\nHergestellte Werte von SwitchBool anpassbar und umbenannt 'SwitchBool' zu 'Switch'\nReparierte Benachrichtigung Widget\nApple Standard Schriftart 'SanFrancisco' zu Schriftarten hinzugefügt (erforderlich, separat installiert zu werden)",
        "ru": "Добавлено Pinpad-Dialog\nДобавлено HTML-Dialog\nДобавлен hkt-Config-Modal (экспериментальный): меняет стили модальности на размытость вместо цвета фона и прозрачности (модуль темнеет фон, когда открывается диалоговое окно). Для этого элемента конфигурации необходимо ipadOS 18.x для работы с Safari или ioBroker Visu App. Просто поместите элемент настройки где-то в вашем VIS, где его всегда называют (например, в меню) и настройте его по мере необходимости. Он не виден в рабочее время.\nСделано \"модуль\" для настройки по умолчанию\nРаздел «диалог» разделился на «настройка диалогов» и «диалог контента» \"\nСделанные значения SwitchBool настраиваемые и переименованные в «SwitchBool» в «Switch»\nРемонт виджета уведомления\nДобавлен стандартный шрифт Apple «SanFrancisco» для шрифтов (необходимо устанавливать отдельно)",
        "pt": "Adicionado Pinpad-Dialog\nAdicionado HTML-Dialog\nAdicionado hkt-Config-Modal (experimental): muda os estilos de modal para borrar em vez de cor de fundo e transparência (modal obscurece o fundo quando uma janela de diálogo é aberta). Para este config-item você precisa ipadOS 18.x para trabalhar com Safari ou ioBroker Visu App. Basta colocar o item de configuração em algum lugar no seu VIS onde é sempre chamado (por exemplo, no menu) e configurá-lo como desejado. Não é visível no tempo de execução.\nFeito \"modal\" para configuração padrão\nSeção 'dialog' dividido em 'configurações de diário' e 'conteúdo diário' '\nOs valores feitos de SwitchBool personalizável e renomeado 'SwitchBool' para 'Switch'\nWidget de notificação reparado\nAdicionado fonte padrão Apple 'SanFrancisco' para fontes (necessário para ser instalado separadamente)",
        "nl": "Pinpad-dialoog toegevoegd\nHTML-dialoog toegevoegd\nToegevoegd hkt-Config-Modal (experimenteel): verandert de stijlen van de modale om te vervagen in plaats van achtergrondkleur en transparantie (modal verduistert de achtergrond wanneer een dialoogvenster geopend is). Voor dit config-item heb je ipadOS 18.x nodig om te werken met Safari of ioBroker Visu App. Plaats het config item gewoon ergens in uw VIS waar het altijd wordt genoemd (bijvoorbeeld in het menu) en configureer het naar wens. Het is niet zichtbaar op runtime.\n\"modal\" naar standaardinstelling gemaakt\nSectie 'dialoog' verdeeld in 'dialoog-instellingen' en 'dialoog-inhoud' '\nGemaakt waarden van SwitchBool aanpasbaar en hernoemd 'SwitchBool' naar 'Switch'\nRepareerde notificatie-widget\nToegevoegd Apple standaard lettertype 'SanFrancisco' aan lettertypen (moet afzonderlijk worden geïnstalleerd)",
        "fr": "Ajouté Pinpad-Dialog\nAjouté HTML-Dialog\nAjouté hkt-Config-Modal (expérimental) : change les styles de modal pour brouiller au lieu de couleur de fond et de transparence (modal assombrit l'arrière-plan lorsqu'une fenêtre de dialogue est ouverte). Pour ce config-item, vous avez besoin d'ipadOS 18.x pour travailler avec Safari ou ioBroker Visu App. Il suffit de placer l'élément de configuration quelque part dans votre VIS où il est toujours appelé (par exemple dans le menu) et de le configurer comme désiré. Il n'est pas visible à l'exécution.\nFait \"modal\" au réglage par défaut\nSection 'dialog' divisée en 'dialog settings' et 'dialog content' '\nValeurs de SwitchBool personnalisables et renommés 'SwitchBool' en 'Switch'\nWidget de notification réparé\nAjout de la police standard Apple 'SanFrancisco' aux polices (nécessaire pour être installé séparément)",
        "it": "Aggiunto Pinpad-Dialog\nAggiunto HTML-Dialog\nAggiunto hkt-Config-Modal (esperimentale): cambia gli stili di modal a sfocatura invece di sfondo colore e trasparenza (modal oscura lo sfondo quando una finestra di dialogo è aperta). Per questo config-item è necessario che ipadOS 18.x funzioni con Safari o ioBroker Visu App. Basta posizionare l'elemento di configurazione da qualche parte nel VIS dove viene sempre chiamato (ad esempio nel menu) e configurarlo come desiderato. Non è visibile a runtime.\nMade \"modal\" per impostazione predefinita\nSezione 'dialogo' suddivisa in 'impostazione di dialogo' e 'contenuti di dialogo '\nValori fatti di SwitchBool personalizzabile e rinominato 'SwitchBool' a 'Switch'\nWidget di notifica riparato\nAggiunto il carattere standard Apple 'SanFrancisco' ai caratteri (necessario per essere installato separatly)",
        "es": "Añadido Pinpad-Dialog\nAñadido HTML-Dialog\nAñadido hkt-Config-Modal (experimental): cambia los estilos de modal a borrón en lugar de color de fondo y transparencia (modal oscura el fondo cuando se abre una ventana de diálogo). Para este config-item necesitas ipadOS 18.x para trabajar con Safari o ioBroker Visu App. Simplemente coloque el elemento de configuración en algún lugar de su VIS donde siempre se llama (por ejemplo, en el menú) y configure como se desee. No es visible a tiempo de ejecución.\nHecho \"modal\" a configuración predeterminada\nSección 'dialog' se dividió en 'configuración de diálogo' y 'contenido de diálogo '\nValores hechos de SwitchBool personalizable y renombrado 'SwitchBool' a 'Switch'\nWidget de notificación reparada\nAñadido Apple standard font 'SanFrancisco' a fuentes (necesitado para ser instalado separadamente)",
        "pl": "Dodano okno Pinpad-\nDodano okno HTML-\nDodano hkt- Configura- Modal (eksperymentalny): zmienia style modalne na zamazane zamiast koloru tła i przejrzystości (modal zaciemnia tło po otwarciu okna dialogowego). Do tego konfigurowalnego elementu potrzebny jest ipadOS 18.x do pracy z aplikacją Safari lub joBroker Visu. Po prostu umieścić element konfiguracyjny gdzieś w Twoim VIS, gdzie jest zawsze wywoływany (np. w menu) i skonfigurować go zgodnie z życzeniem. Nie jest widoczny w czasie biegu.\nWykonane \"modal\" do ustawienia domyślnego\nSekcja 'okno dialogowe' podzielona na 'ustawienia dialogowe' i 'zawartość okna dialogowego'\nWykonane wartości SwitchBool można dostosować i zmienić nazwę 'SwitchBool' na 'Switch'\nZmieniony widżet powiadomień\nDodano standardową czcionkę Apple 'a' SanFrancisco 'do czcionek (potrzebne do instalacji oddzielnie)",
        "uk": "Додано Pinpad-Dialog\nДодано HTML-Dialog\nДодано hkt-Config-Modal (experimental): зміни стилів модального розмиття замість фонового кольору і прозорості (модальні темніє фон, коли діалогове вікно відкрито). Для цього налаштування вам потрібно ipadOS 18.x для роботи з Safari або ioBroker Visu App. Просто розмістіть пункт налаштування десь у VIS, де він завжди називається (наприклад, у меню) і налаштуйте його бажаним. Не видно в режимі runtime.\nВиготовлений \"модальний\" для налаштування за замовчуванням\nРозділ «Ділог» розщеплюється на налаштування «Діалога» та «Діалог» Р\nВиготовлені значення SwitchBool налаштовані і перейменовані 'SwitchBool' до 'Switch'\nРемонтний віджет повідомлення\nДодано стандартний шрифт Apple 'SanFrancisco' до шрифтів (установлений для встановлення separatly)",
        "zh-cn": "已添加 Pinpad- Dialog\n已添加 HTML- Dialog\n添加 hkt-Config-Modal(实验性):改变模式的样式以模糊而不是背景颜色和透明度(模式在对话框打开时暗化背景). 对于这个配置项目,你需要ipadOS 18.x与Safari或ioBroker Visu App合作. 简单地将配置项放在您 VIS 的某个地方, 它总是被称作( 如在菜单中) , 并按需要配置 。 运行时不可见 .\n将“模式”设定为默认设置\n区域“ dialog” 分割为“ dialog 设置 ” 和“ dialog 内容 ”  '\n将 SwitchBool 的值自定义化并改名为 “ SwitchBool ” \n已修复的通知部件\n添加到字体中的 Apple 标准字体“ SanFrancisco ” (需要单独安装)"
      }
    },
    "titleLang": {
      "en": "HomeKit-Tiles",
      "de": "HomeKit-Kacheln",
      "ru": "ГлавнаяKit-Tiles",
      "pt": "Blocos HomeKit",
      "nl": "HomeKit-tegels",
      "fr": "AccueilKit-Carreaux",
      "it": "HomeKit-Piastrelle",
      "es": "InicioKit-Azulejos",
      "pl": "HomeKit-Płytki",
      "zh-cn": "HomeKit-瓷砖",
      "uk": "HomeKit-Tiles"
    },
    "desc": {
      "en": "VIS widgets in HomeKit style",
      "de": "VIS-Widgets im HomeKit-Stil",
      "ru": "Виджеты VIS в стиле HomeKit",
      "pt": "Widgets VIS no estilo HomeKit",
      "nl": "VIS-widgets in HomeKit-stijl",
      "fr": "Widgets VIS dans le style HomeKit",
      "it": "Widget VIS in stile HomeKit",
      "es": "Widgets VIS en estilo HomeKit",
      "pl": "Widżety VIS w stylu HomeKit",
      "zh-cn": "HomeKit 风格的 VIS 小部件",
      "uk": "Віджети VIS у стилі HomeKit"
    },
    "authors": [
      "Standarduser <github.com@sebastiankoehler.de>"
    ],
    "keywords": [
      "visualization",
      "vis",
      "homekit"
    ],
    "tier": 3,
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "vis-homekittiles.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Standarduser/ioBroker.vis-homekittiles/main/admin/vis-homekittiles.png",
    "readme": "https://github.com/Standarduser/ioBroker.vis-homekittiles/blob/main/README.md",
    "loglevel": "info",
    "restartAdapters": [
      "vis",
      "vis-2"
    ],
    "onlyWWW": true,
    "adminUI": {
      "config": "none"
    },
    "singleton": true,
    "type": "visualization-widgets",
    "mode": "none",
    "dependencies": [
      "vis"
    ],
    "globalDependencies": [],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=0.0.16",
            "newVersion>0.0.16"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!"
        },
        "text": {
          "en": "After this update, all tile widgets must be clicked once so that the display is correct again! There is nothing else to do, just click on it.",
          "de": "Nach diesem Update müssen alle Kachel-Widgets einmal angeklickt werden, damit die Darstellung wieder korrekt ist! Es ist sonst nichts weiter zu tun, nur anklicken."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
