{
  "common": {
    "name": "vis-homekittiles",
    "version": "0.4.0",
    "news": {
      "0.4.0": {
        "en": "Added Pinpad-Dialog\nAdded HTML-Dialog\nAdded hkt-Config-Modal (experimental): changes the styles of modal to blur instead of background color and transparency (modal darkens the background when a dialog window is open). For this config-item you need ipadOS 18.x to work with Safari or ioBroker Visu App. Simply place the config item somewhere in your VIS where it is always called (e.g. in the menu) and configure it as desired. It is not visible at runtime.\nMade \"modal\" to default setting\nSection 'dialog' splitted into 'dialog settings' and 'dialog content'\nMade values of SwitchBool customizable and renamed 'SwitchBool' to 'Switch'\nRepaired notification widget\nAdded Apple standard font 'SanFrancisco' to fonts (needed to be installed separatly)",
        "de": "Pinpad-Dialog hinzugefügt\nHTML-Dialog hinzugefügt\nHinzugefügt hkt-Config-Modal (experimental): ändert die Stile von Modal zu verschwimmen statt Hintergrundfarbe und Transparenz (modal verdunkelt den Hintergrund, wenn ein Dialogfenster geöffnet ist). Für dieses config-item benötigen Sie ipadOS 18.x, um mit Safari oder ioBroker Visu App zu arbeiten. Legen Sie einfach den config Artikel irgendwo in Ihrem VIS, wo er immer aufgerufen wird (z.B. im Menü) und konfigurieren Sie ihn wie gewünscht. Es ist nicht zur Laufzeit sichtbar.\nHergestellt \"modal\" zur Standardeinstellung\nAbschnitt \"Dialog\" aufgeteilt in \"Dialogeinstellungen\" und \"Dialoginhalte\" '\nHergestellte Werte von SwitchBool anpassbar und umbenannt 'SwitchBool' zu 'Switch'\nReparierte Benachrichtigung Widget\nApple Standard Schriftart 'SanFrancisco' zu Schriftarten hinzugefügt (erforderlich, separat installiert zu werden)",
        "ru": "Добавлено Pinpad-Dialog\nДобавлено HTML-Dialog\nДобавлен hkt-Config-Modal (экспериментальный): меняет стили модальности на размытость вместо цвета фона и прозрачности (модуль темнеет фон, когда открывается диалоговое окно). Для этого элемента конфигурации необходимо ipadOS 18.x для работы с Safari или ioBroker Visu App. Просто поместите элемент настройки где-то в вашем VIS, где его всегда называют (например, в меню) и настройте его по мере необходимости. Он не виден в рабочее время.\nСделано \"модуль\" для настройки по умолчанию\nРаздел «диалог» разделился на «настройка диалогов» и «диалог контента» \"\nСделанные значения SwitchBool настраиваемые и переименованные в «SwitchBool» в «Switch»\nРемонт виджета уведомления\nДобавлен стандартный шрифт Apple «SanFrancisco» для шрифтов (необходимо устанавливать отдельно)",
        "pt": "Adicionado Pinpad-Dialog\nAdicionado HTML-Dialog\nAdicionado hkt-Config-Modal (experimental): muda os estilos de modal para borrar em vez de cor de fundo e transparência (modal obscurece o fundo quando uma janela de diálogo é aberta). Para este config-item você precisa ipadOS 18.x para trabalhar com Safari ou ioBroker Visu App. Basta colocar o item de configuração em algum lugar no seu VIS onde é sempre chamado (por exemplo, no menu) e configurá-lo como desejado. Não é visível no tempo de execução.\nFeito \"modal\" para configuração padrão\nSeção 'dialog' dividido em 'configurações de diário' e 'conteúdo diário' '\nOs valores feitos de SwitchBool personalizável e renomeado 'SwitchBool' para 'Switch'\nWidget de notificação reparado\nAdicionado fonte padrão Apple 'SanFrancisco' para fontes (necessário para ser instalado separadamente)",
        "nl": "Pinpad-dialoog toegevoegd\nHTML-dialoog toegevoegd\nToegevoegd hkt-Config-Modal (experimenteel): verandert de stijlen van de modale om te vervagen in plaats van achtergrondkleur en transparantie (modal verduistert de achtergrond wanneer een dialoogvenster geopend is). Voor dit config-item heb je ipadOS 18.x nodig om te werken met Safari of ioBroker Visu App. Plaats het config item gewoon ergens in uw VIS waar het altijd wordt genoemd (bijvoorbeeld in het menu) en configureer het naar wens. Het is niet zichtbaar op runtime.\n\"modal\" naar standaardinstelling gemaakt\nSectie 'dialoog' verdeeld in 'dialoog-instellingen' en 'dialoog-inhoud' '\nGemaakt waarden van SwitchBool aanpasbaar en hernoemd 'SwitchBool' naar 'Switch'\nRepareerde notificatie-widget\nToegevoegd Apple standaard lettertype 'SanFrancisco' aan lettertypen (moet afzonderlijk worden geïnstalleerd)",
        "fr": "Ajouté Pinpad-Dialog\nAjouté HTML-Dialog\nAjouté hkt-Config-Modal (expérimental) : change les styles de modal pour brouiller au lieu de couleur de fond et de transparence (modal assombrit l'arrière-plan lorsqu'une fenêtre de dialogue est ouverte). Pour ce config-item, vous avez besoin d'ipadOS 18.x pour travailler avec Safari ou ioBroker Visu App. Il suffit de placer l'élément de configuration quelque part dans votre VIS où il est toujours appelé (par exemple dans le menu) et de le configurer comme désiré. Il n'est pas visible à l'exécution.\nFait \"modal\" au réglage par défaut\nSection 'dialog' divisée en 'dialog settings' et 'dialog content' '\nValeurs de SwitchBool personnalisables et renommés 'SwitchBool' en 'Switch'\nWidget de notification réparé\nAjout de la police standard Apple 'SanFrancisco' aux polices (nécessaire pour être installé séparément)",
        "it": "Aggiunto Pinpad-Dialog\nAggiunto HTML-Dialog\nAggiunto hkt-Config-Modal (esperimentale): cambia gli stili di modal a sfocatura invece di sfondo colore e trasparenza (modal oscura lo sfondo quando una finestra di dialogo è aperta). Per questo config-item è necessario che ipadOS 18.x funzioni con Safari o ioBroker Visu App. Basta posizionare l'elemento di configurazione da qualche parte nel VIS dove viene sempre chiamato (ad esempio nel menu) e configurarlo come desiderato. Non è visibile a runtime.\nMade \"modal\" per impostazione predefinita\nSezione 'dialogo' suddivisa in 'impostazione di dialogo' e 'contenuti di dialogo '\nValori fatti di SwitchBool personalizzabile e rinominato 'SwitchBool' a 'Switch'\nWidget di notifica riparato\nAggiunto il carattere standard Apple 'SanFrancisco' ai caratteri (necessario per essere installato separatly)",
        "es": "Añadido Pinpad-Dialog\nAñadido HTML-Dialog\nAñadido hkt-Config-Modal (experimental): cambia los estilos de modal a borrón en lugar de color de fondo y transparencia (modal oscura el fondo cuando se abre una ventana de diálogo). Para este config-item necesitas ipadOS 18.x para trabajar con Safari o ioBroker Visu App. Simplemente coloque el elemento de configuración en algún lugar de su VIS donde siempre se llama (por ejemplo, en el menú) y configure como se desee. No es visible a tiempo de ejecución.\nHecho \"modal\" a configuración predeterminada\nSección 'dialog' se dividió en 'configuración de diálogo' y 'contenido de diálogo '\nValores hechos de SwitchBool personalizable y renombrado 'SwitchBool' a 'Switch'\nWidget de notificación reparada\nAñadido Apple standard font 'SanFrancisco' a fuentes (necesitado para ser instalado separadamente)",
        "pl": "Dodano okno Pinpad-\nDodano okno HTML-\nDodano hkt- Configura- Modal (eksperymentalny): zmienia style modalne na zamazane zamiast koloru tła i przejrzystości (modal zaciemnia tło po otwarciu okna dialogowego). Do tego konfigurowalnego elementu potrzebny jest ipadOS 18.x do pracy z aplikacją Safari lub joBroker Visu. Po prostu umieścić element konfiguracyjny gdzieś w Twoim VIS, gdzie jest zawsze wywoływany (np. w menu) i skonfigurować go zgodnie z życzeniem. Nie jest widoczny w czasie biegu.\nWykonane \"modal\" do ustawienia domyślnego\nSekcja 'okno dialogowe' podzielona na 'ustawienia dialogowe' i 'zawartość okna dialogowego'\nWykonane wartości SwitchBool można dostosować i zmienić nazwę 'SwitchBool' na 'Switch'\nZmieniony widżet powiadomień\nDodano standardową czcionkę Apple 'a' SanFrancisco 'do czcionek (potrzebne do instalacji oddzielnie)",
        "uk": "Додано Pinpad-Dialog\nДодано HTML-Dialog\nДодано hkt-Config-Modal (experimental): зміни стилів модального розмиття замість фонового кольору і прозорості (модальні темніє фон, коли діалогове вікно відкрито). Для цього налаштування вам потрібно ipadOS 18.x для роботи з Safari або ioBroker Visu App. Просто розмістіть пункт налаштування десь у VIS, де він завжди називається (наприклад, у меню) і налаштуйте його бажаним. Не видно в режимі runtime.\nВиготовлений \"модальний\" для налаштування за замовчуванням\nРозділ «Ділог» розщеплюється на налаштування «Діалога» та «Діалог» Р\nВиготовлені значення SwitchBool налаштовані і перейменовані 'SwitchBool' до 'Switch'\nРемонтний віджет повідомлення\nДодано стандартний шрифт Apple 'SanFrancisco' до шрифтів (установлений для встановлення separatly)",
        "zh-cn": "已添加 Pinpad- Dialog\n已添加 HTML- Dialog\n添加 hkt-Config-Modal(实验性):改变模式的样式以模糊而不是背景颜色和透明度(模式在对话框打开时暗化背景). 对于这个配置项目,你需要ipadOS 18.x与Safari或ioBroker Visu App合作. 简单地将配置项放在您 VIS 的某个地方, 它总是被称作( 如在菜单中) , 并按需要配置 。 运行时不可见 .\n将“模式”设定为默认设置\n区域“ dialog” 分割为“ dialog 设置 ” 和“ dialog 内容 ”  '\n将 SwitchBool 的值自定义化并改名为 “ SwitchBool ” \n已修复的通知部件\n添加到字体中的 Apple 标准字体“ SanFrancisco ” (需要单独安装)"
      },
      "0.3.3": {
        "en": "Added new style \"text only\" to switch and view-in-widget-dialog tiles\nFixed some issues from adapter checker\nFixed some styles of view-in-widget-swipe\nAdded arrow indicators to view-in-widget-swipe",
        "de": "Hinzugefügt neuen Stil \"text only\" zu wechseln und Ansicht-in-widget-dialog Fliesen\nBehoben einige Probleme von Adapter Checker\nBehoben einige Stile der Ansicht-in-widget-swipe\nHinzufügen von Pfeilanzeigen zur Ansicht in-widget-swipe",
        "ru": "Добавлен новый стиль «только текст» для переключения и вид-в-widget-диалог плитки\nИсправлены некоторые проблемы из адаптера\nИсправлены некоторые стили зрения-in-widget-swipe\nДобавленные стрелки для просмотра-in-widget-swipe",
        "pt": "Adicionado novo estilo \"text only\" para mudar e view-in-widget-dialog telhas\nCorrigido alguns problemas do verificador do adaptador\nCorrigido alguns estilos de view-in-widget-swipe\nAdicionados indicadores de seta para view-in-widget-swipe",
        "nl": "Nieuwe stijl \"alleen tekst\" toegevoegd om te schakelen en te bekijken-in-widget-dialoogtegels\nEnkele problemen opgelost van adaptercontrole\nVaste sommige stijlen van view-in-widget-swipe\nToegevoegd pijlindicatoren om te bekijken-in-widget-swipe",
        "fr": "Ajout d'un nouveau style \"texte seulement\" pour basculer et afficher les tuiles dans le widget-dialog\nCorrection de certains problèmes de l'adaptateur checker\nCorrection de certains styles de vision-in-widget-swipe\nAjout d'indicateurs de flèches pour visualiser dans le widget",
        "it": "Aggiunto nuovo stile \"solo testo\" per passare e view-in-widget-dialog piastrelle\nRisolto alcuni problemi da adattatore checker\nFisso alcuni stili di view-in-widget-swipe\nIndicatori freccia aggiunti per view-in-widget-swipe",
        "es": "Añadido nuevo estilo \"solo texto\" para cambiar y ver-en-widget-dialog azulejos\nArreglar algunos problemas desde el control de adaptador\nArreglado algunos estilos de vista-en-widget-swipe\nIndicadores de flecha añadidos para ver-en-widget-swipe",
        "pl": "Dodano nowy styl \"tylko tekst\", aby przełączać i przeglądać okna dialogowe\nNaprawiono kilka problemów z sprawdzania adaptera\nNaprawiono niektóre style view- in- widget- swipe\nDodano wskaźniki strzałek do view- in- widget- swipe",
        "uk": "Додано новий стиль \"текст тільки\" для перемикання і перегляду-in-widget-dialog плитка\nВиправлено деякі питання від перевірки адаптера\nВиправлено деякі стилі перегляду\nДодано стрілкові індикатори для перегляду",
        "zh-cn": "添加新样式“ 只有文本” 以切换和查看 Widget- 对话框牌\n解决适配器检查器的一些问题\n修整一些视图的样式\n添加到视图中的箭头指示器"
      },
      "0.3.2": {
        "en": "Added option to show icons colored on tiles and radio\nAdded new styles \"big\", \"small\" and \"only icon\" for all tiles\nJSON Table: set no fixed height (min-hight is now 32px)",
        "de": "Option hinzugefügt, um Icons auf Fliesen und Radio gefärbt zu zeigen\nNeue Stile \"groß\", \"klein\" und \"nur Ikone\" für alle Fliesen hinzugefügt\nJSON Tabelle: keine feste Höhe setzen (min-hight ist jetzt 32px)",
        "ru": "Добавить опцию, чтобы показать иконки, цветные на плитках и радио\nДобавлены новые стили «большой», «маленький» и «только икона» для всех плиток\nJSON Таблица: не установленная высота (min-hight теперь 32px)",
        "pt": "Adicionado opção para mostrar ícones coloridos em azulejos e rádio\nAdicionado novos estilos \"grande\", \"pequeno\" e \"apenas ícone\" para todos os azulejos\nJSON Tabela: não definir altura fixa (min-hight é agora 32px)",
        "nl": "Toegevoegd optie om pictogrammen op tegels en radio te tonen\nNieuwe stijlen \"grote,\" \"klein\" en \"alleen pictogram\" toegevoegd voor alle tegels\nJSON Tabel: geen vaste hoogte instellen (min-higet is nu 32px)",
        "fr": "Ajout d'une option pour afficher des icônes colorées sur les carreaux et la radio\nAjout de nouveaux styles \"grand\", \"petit\" et \"unique icône\" pour toutes les tuiles\nJSON Tableau: Pas de hauteur fixe (la hauteur minimale est maintenant 32px)",
        "it": "Aggiunta opzione per mostrare icone colorate su piastrelle e radio\nAggiunto nuovi stili \"grande\", \"piccolo\" e \"solo icona\" per tutte le piastrelle\nJSON Tabella: non impostare altezza fissa (min-hight è ora 32px)",
        "es": "Opción agregada para mostrar iconos de colores en azulejos y radio\nNuevos estilos \"grandes\", \"pequeñas\" y \"sólo icono\" para todos los azulejos\nJSON Tabla: no fija altura fija (mínimo-alto es ahora 32px)",
        "pl": "Dodano opcję, aby pokazać ikony kolorowe na płytki i radio\nDodano nowe style \"duże\", \"małe\" i \"tylko ikona\" dla wszystkich płytek\nJSON Tabela: nie ustawiono stałej wysokości (min- hight jest teraz 32px)",
        "uk": "Додано варіант показати іконки кольорові на плитці і радіо\nДодано нові стилі \"великий\", \"малий\" і \"тільки іконка\" для всіх плиток\nСонце Маса нетто фіксована висота (min-hight тепер 32px)",
        "zh-cn": "添加选项以显示砖块和收音机上的颜色图标\n为所有瓷砖添加新样式“ 大”、“ 小” 和“ 只有图标 ”\n贾森 表格:没有固定高度( min- hight 现在为 32px)"
      },
      "0.3.1": {
        "en": "Added submenu widget",
        "de": "Submenu Widget",
        "ru": "Добавить виджет подменю",
        "pt": "Adicionado widget submenu",
        "nl": "Submenu-widget toegevoegd",
        "fr": "Ajout du sous-menu widget",
        "it": "Aggiunto sottomenu widget",
        "es": "Widget submenu",
        "pl": "Dodano widżet podmenu",
        "uk": "Додано субмену віджет",
        "zh-cn": "添加子菜单部件"
      },
      "0.2.7": {
        "en": "repaired Thermostat dialog tile widget",
        "de": "reparatur Thermostat Dialog Kachel Widget",
        "ru": "отремонтированный диалоговый виджет",
        "pt": "widget de telha de diálogo termostato reparado",
        "nl": "gerepareerd Thermostat dialoogvenster tile widget",
        "fr": "widget de boîte de dialogue Thermostat réparé",
        "it": "riparato Termostato dialogo piastrelle widget",
        "es": "medidor de diálogo termostato reparado",
        "pl": "naprawiony widżet okna dialogowego Termostat",
        "uk": "відремонтований термостат діалоговий віджет плитки",
        "zh-cn": "已修复的自动调温对话框瓦件"
      },
      "0.2.6": {
        "en": "Block operation: added ability to show widget disabled\nAdded JSON Table\nNavigation-Button-Set: fixed notification arrangement\nDynamization of some input fields",
        "de": "Blockbetrieb: Zusatzfähigkeit Widget deaktiviert anzeigen\nHinzugefügt JSON Tabelle\nNavigation-Button-Set: feste Benachrichtigungsanordnung\nDynamisierung einiger Eingabefelder",
        "ru": "Блок-операция: добавленная способность показать виджет\nДобавить JSON Таблица 1\nНавигация-Буттон-Сет: фиксированное уведомление\nДинамизация некоторых входных полей",
        "pt": "Operação do bloco: adicionado capacidade de mostrar widget desativado\nAdicionado JSON Quadro\nNavigation-Button-Set: arranjo de notificação fixa\nDynamization de alguns campos de entrada",
        "nl": "Blokbewerking: toegevoegde mogelijkheid om widget te tonen uitgeschakeld\nToegevoegd JSON Tabel\nNavigatie-Button-Set: vaste meldingsregeling\nDynamisering van enkele invoervelden",
        "fr": "Opération de bloc: possibilité supplémentaire d'afficher un widget désactivé\nJSON ajouté Tableau\nNavigation-Button-Set: système de notification fixe\nDynamisation de certains champs d'entrée",
        "it": "Funzionamento del blocco: aggiunta capacità di mostrare widget disabilitati\nAggiunto JSON Tabella\nNavigazione-Button-Set: accordo di notifica fisso\nDinamizzazione di alcuni campi di input",
        "es": "Funcionamiento del bloque: capacidad adicional para mostrar widget deshabilitado\nAñadido JSON Cuadro\nNavegación-Button-Set: arreglo de notificación fija\nDinasmización de algunos campos de entrada",
        "pl": "Operacja bloku: dodana możliwość pokazania wyłączonych widżetów\nDodano JSON Tabela\nNavigation- Button- Set: stałe rozwiązanie notyfikacyjne\nDynamizacja niektórych pól wejściowych",
        "uk": "Функція блокування: додана можливість показати відключені віджети\nДоданий JSON Настільний\nНавігація-Button-Set: фіксоване розташування повідомлень\nДинамізація деяких родовищ",
        "zh-cn": "块操作: 显示部件的新增能力已禁用\n添加的 JSON 数据 图表\n导航-按钮-一组:固定通知安排\n一些输入字段的动态化"
      },
      "0.1.1": {
        "en": "Added missing translations\nAdded new style \"indicator\" for all tiles (IF YOUR TILES LOOK BROKEN AFTER UPDATE: SELECT EVERY TILE IN EDITOR - JUST CLICK ON IT. Sorry for that.)\nRadiobutton: new property \"division\" with selectable values\nRadiobutton: change size automatically if direction was changed\nSignal pictures: repaired comparision with number (<=nn)\nSignal pictures: checkbox for show/not show in editor\nThermostat dialog: sort order of attributes (dialog attrs one up)",
        "de": "Fehlende Übersetzungen hinzugefügt\nHinzugefügt neue Stil \"Indikator\" für alle Fliesen (IFEN IHRE TILES LOOK BROKEN AFTER UPDATE: SELECT EVERY TILE IN EDITOR - KLICK einfach auf die IT. Tut mir leid.)\nRadiobutton: neue Eigenschaft \"Division\" mit auswählbaren Werten\nRadiobutton: Größe automatisch ändern, wenn Richtung geändert wurde\nSignalbilder: reparierte Komparision mit Nummer (<=nn)\nSignalbilder: Checkbox für Show/nicht im Editor anzeigen\nThermostat Dialog: Sortieren von Attributen (dialog attrs one up)",
        "ru": "Добавлены недостающие переводы\nДобавлен новый стиль «индикатор» для всех плиток (IF ВАШ ТИЛЫ ОЗНАЧАЕТ BROKEN AFTER UPDATE: Желаю, чтобы все было в порядке. Простите за это.)\nRadiobutton: новое свойство «разделение» с подобранными значениями\nRadiobutton: автоматически изменить размер, если направление было изменено\nСигнальные фотографии: отремонтированное сопоставание с номером (<=nn)\nСигналы: флажок для показа/не показывать в редакторе\nДиалог термостата: сортировка атрибутов (диалог = один вверх)",
        "pt": "Adicionadas traduções em falta\nAdicionado novo estilo \"indicador\" para todas as telhas (Se SUAS TILES LOOK BROKEN APOIO: Esclareça todas as vezes em EDITOR - basta pegar nela. Desculpe.)\nRadiobutton: nova propriedade \"divisão\" com valores selecionáveis\nRadiobutton: mudar o tamanho automaticamente se a direção foi alterada\nImagens do sinal: comparisão reparado com número (<=nn)\nImagens de sinal: caixa de seleção para mostrar/não mostrar no editor\nDiálogo termostato: ordem de classificação de atributos (dialog attrs one up)",
        "nl": "Toegevoegd ontbrekende vertalingen\nToegevoegd nieuwe stijl \"indicator\" voor alle tegels (als UW TILLEN BEKIJKEN NA UPDATE: selecteer alles in de editor. Sorry daarvoor.)\nRadioknop: nieuwe eigenschap \"verdeling\" met selecteerbare waarden\nRadioknop: formaat automatisch wijzigen bij verandering van richting\nSignaalbeelden: gerepareerde vergelijking met nummer (<=nn)\nSignaalbeelden: selectievakje voor tonen/niet tonen in editor\nThermostat dialoogvenster: sorteer orde van eigenschappen (dialog attrs one up)",
        "fr": "Ajout de traductions manquantes\nAjout d'un nouveau style \"indicateur\" pour toutes les tuiles (SI VOS TILES APRÈS LA MISE À JOUR : SÉLECTIONNEZ TOUS LES TILES DE L'ÉDITEUR - CLIQUEZ-VOUS dessus. Désolé pour ça.)\nRadiobouton: nouvelle propriété \"division\" avec des valeurs sélectionnables\nRadiobouton : changer la taille automatiquement si la direction est changée\nPhotos du signal: Comparision réparée avec nombre (<=nn)\nPhotos des signaux : case à cocher pour afficher/ne pas afficher dans l'éditeur\nBoîte de dialogue Thermostat : trier l'ordre des attributs (dialog attrs one up)",
        "it": "Aggiunte le traduzioni mancanti\nAggiunto nuovo stile \"indicatore\" per tutte le piastrelle (IF TUO TILES LOOK BROKEN AFTER UPDATE: SELECT EVERY TILE IN EDITOR - CLICCA solo su di esso. Mi dispiace.)\nRadiobutton: nuova proprietà \"divisione\" con valori selezionabili\nRadiobutton: cambiare la dimensione automaticamente se la direzione è stata cambiata\nImmagini di segnale: bussola riparata con numero (±=nn)\nImmagini di segnale: checkbox per show/not show in editor\nFinestra di dialogo Termostato: ordina ordine di attributi (attori di dialogo uno su)",
        "es": "Añadido traducciones desaparecidas\nAgregado nuevo estilo \"indicador\" para todas las fichas (si tus TILES parecen BROKEN AFTER UPDATE: Cálmese todo lo que hay en el índice. Lo siento.)\nRadiobutton: nueva propiedad \"división\" con valores seleccionables\nRadiobuttón: cambiar el tamaño automáticamente si la dirección fue cambiada\nFotos de señalización: comparación reparada con número (traducido=nn)\nFotos de la señal: checkbox for show/not show in editor\nDiálogo termostato: orden de atributos (los attrs de diálogo uno arriba)",
        "pl": "Dodano brakujące tłumaczenia\nDodano nowy styl \"wskaźnik\" dla wszystkich płytek (jeśli Twoje palce wyglądają broken po update: Wybierzcie każdy moment w Editorze. Przepraszam.)\nRadiobutton: nowa właściwość \"podział\" z wartościami do wyboru\nRadiobutton: zmienić rozmiar automatycznie jeśli kierunek został zmieniony\nObrazy sygnałowe: naprawione porównanie z liczbą (< = nn)\nZdjęcia sygnałowe: pole wyboru dla wyświetlania / nie wyświetlania w edytorze\nOkno termostatu: sortuj kolejność atrybutów (okno attrs one up)",
        "uk": "Додано відсутні переклади\nДодано новий стиль \"індикатор\" для всіх плиток (IF ВАШІ ЧАСТИНИ ЗАБЕЗПЕЧЕННЯ БРОКЕНА: ЗБЕРІГАЙТЕ ВСІ ЧАСТИНИ В EDITOR - ЗАБЕЗПЕЧИТИ НА ІТ. Про нас\nRadiobutton: нова нерухомість \"division\" з вибраними значеннями\nRadiobutton: зміни розміру автоматично, якщо напрямок було змінено\nЗнімки сигналу: відремонтована компаріація з номером (<=nn)\nЗнакові фотографії: прапорець для шоу/не шоу в редакторі\nТермостат діалогове вікно: сортування атрибутів (dialog attrs one up)",
        "zh-cn": "缺少的翻译\n为所有牌子添加了新样式“ 指示器 ” (如果您的倾斜显示在更新后 : 自己在编辑器中的所有东西,只是点击它。 对不起。 )\n无线电按钮:带有可选值的新属性\"分割\"\n无线电按钮: 如果方向改变, 自动更改大小\n信号图片:修复后与数字的比对(<=nn)\n信号图片 : 编辑器中显示/ 不显示的复选框\n自动调温对话框: 属性的排序顺序( 对话框上移一个)"
      }
    },
    "titleLang": {
      "en": "HomeKit-Tiles",
      "de": "HomeKit-Kacheln",
      "ru": "ГлавнаяKit-Tiles",
      "pt": "Blocos HomeKit",
      "nl": "HomeKit-tegels",
      "fr": "AccueilKit-Carreaux",
      "it": "HomeKit-Piastrelle",
      "es": "InicioKit-Azulejos",
      "pl": "HomeKit-Płytki",
      "zh-cn": "HomeKit-瓷砖",
      "uk": "HomeKit-Tiles"
    },
    "desc": {
      "en": "VIS widgets in HomeKit style",
      "de": "VIS-Widgets im HomeKit-Stil",
      "ru": "Виджеты VIS в стиле HomeKit",
      "pt": "Widgets VIS no estilo HomeKit",
      "nl": "VIS-widgets in HomeKit-stijl",
      "fr": "Widgets VIS dans le style HomeKit",
      "it": "Widget VIS in stile HomeKit",
      "es": "Widgets VIS en estilo HomeKit",
      "pl": "Widżety VIS w stylu HomeKit",
      "zh-cn": "HomeKit 风格的 VIS 小部件",
      "uk": "Віджети VIS у стилі HomeKit"
    },
    "authors": [
      "Standarduser <github.com@sebastiankoehler.de>"
    ],
    "keywords": [
      "visualization",
      "vis",
      "homekit"
    ],
    "tier": 3,
    "licenseInformation": {
      "type": "free",
      "license": "MIT"
    },
    "platform": "Javascript/Node.js",
    "icon": "vis-homekittiles.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Standarduser/ioBroker.vis-homekittiles/main/admin/vis-homekittiles.png",
    "readme": "https://github.com/Standarduser/ioBroker.vis-homekittiles/blob/main/README.md",
    "loglevel": "info",
    "restartAdapters": [
      "vis"
    ],
    "onlyWWW": true,
    "adminUI": {
      "config": "none"
    },
    "singleton": true,
    "type": "visualization-widgets",
    "mode": "none",
    "dependencies": [
      "vis"
    ],
    "globalDependencies": [],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=0.0.16",
            "newVersion>0.0.16"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!"
        },
        "text": {
          "en": "After this update, all tile widgets must be clicked once so that the display is correct again! There is nothing else to do, just click on it.",
          "de": "Nach diesem Update müssen alle Kachel-Widgets einmal angeklickt werden, damit die Darstellung wieder korrekt ist! Es ist sonst nichts weiter zu tun, nur anklicken."
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
